# 11.09.2026
# Rozalia Manik (id postlink=792854)
# Дано целое число A. Проверить истинность высказывания: «Число A является четным».
# Дано целое число A. Проверить истинность высказывания: «Число A является нечетным».
# Примечание: В задании  требуется вывести логическое значение True, если выражение
# для введеных исходных данных является истинным, и значение False в противном случае.

A = int(input("Введите целое число: "))

print(f"Число A является четным:: {A % 2 == 0}")
print(f"Число A является нечетным:: {A % 2 != 0}")