# 11.09.2026
# Rozalia Manik (id postlink=792854)
# Единицы массы пронумерованы следующим образом: 1 — килограмм, 2 — миллиграмм, 3 — грамм,
# 4 — тонна, 5 — центнер. Дан номер единицы массы и масса тела M в этих единицах (вещественное число)
# Вывести массу данного тела в килограммах


unit = int(input("Введите номер единицы массы: 1 - килограмм, 2 - миллиграмм, 3 - грамм, 4 - тонна, 5 - центнер: "))
M = float(input("Масса тела M в этих же единицах: "))

if unit == 1:
    kg = M
elif unit == 2:
    kg = M * 1e-6
elif unit == 3:
    kg = M * 0.001
elif unit == 4:
    kg = M * 1000
elif unit == 5:
    kg = M * 100
else:
    kg = 0

print(kg)