# 11.09.2026
# Rozalia Manik (id postlink=792854)
# Написать программу, которая считывает два числа и выводит их сумму, разность, частное, произведение,
# результат целочисленного деления, результат деления с остатком, результат возведения в степень.


a = float(input("Введите первое число: "))
b = float(input("Введите второе число: "))

print(f"Сумма: {a + b}")
print(f"Разность: {a - b}")
print(f"Произведение: {a * b}")
if b != 0:
    print(f"Частное: {a / b}")
    print(f"Целочисленное деление: {int(a // b)}")
    print(f"Остаток от деления: {a % b}")
else:
    print("Частное: деление на ноль невозможно")
    print("Целочисленное деление: деление на ноль невозможно")
    print("Остаток от деления: деление на ноль невозможно")

print(f"Степень: {a ** b}") 
